In [ ]:
#판다스 : 시리즈(시계열) 클래스, 데이터프레임 클래스
# 시리즈 = 인덱스(데이터 의미 표시) + 값(데이터)
# 20210804 100
# 20210805 200
# 20210806 500

In [1]:
import pandas as pd

In [8]:
# 리스트, 1차원 배열 -> 시리즈 생성 
pd.Series([1000,300,200]) # 시리즈 객체 생성. 데이터만 기술. 인덱스는 자동 부여됨
pd.Series([1000,300,200], index=['서울인구', '부산인구', '대구인구'])
pd.Series([1000,300,200], index=[10,20,30])
pd.Series([1000,300,200], index=[804,805,806])

x= pd.Series([1000,300,200], index=['20210804', '20210805', '20210806']) # 인덱스 라벨이라고 함

In [17]:
# Label(라벨, 레이블)(눈에 보이는 숫자)
# loc 속성 : Label을 지정하여 데이터를 검색 (레이블 기준)
# iloc 속성
x.loc['20210804']
x.iloc[0]

# 시리즈 인덱스는 고유의 인덱스(0번부터 시작~)와 라벨로 표현됨
# x.iloc[-1] 에러발생
x.iloc[-1] # 뒤에서 첫번째에 해당하는 값을 찾는다.

200

In [19]:
x=pd.Series([1000,300,200], index=[0,1,2])
x

0    1000
1     300
2     200
dtype: int64

In [22]:
x.loc[0]
x.iloc[0]

1000

In [25]:
x=pd.Series(range(100, 105))

In [29]:
x.index # 인덱스값
x.values # 값 추출 
x.name='데이터이름'

In [30]:
x

0    100
1    101
2    102
3    103
4    104
Name: 데이터이름, dtype: int64

In [31]:
#넘파이 배열처럼 시리즈도 벡터화 연산

In [33]:
x=pd.Series([1000,300,200], index=[10,11,12])
x/100

10    10.0
11     3.0
12     2.0
dtype: float64

In [36]:
print(x)
x[10] #x.loc[10]
x[[10,11]]

10    1000
11     300
12     200
dtype: int64

10    1000
11     300
dtype: int64

In [38]:
x=pd.Series([1000,300,200], index=['서울','부산','인천']);x

서울    1000
부산     300
인천     200
dtype: int64

In [41]:
x['인천']
x.loc['인천']
x.iloc[2]

200

In [42]:
x

서울    1000
부산     300
인천     200
dtype: int64

In [48]:
x>250 #데이터에 대해 연산을 수행
x<500
(x>250) & (x<500)
x[(x>250) & (x<500)]

부산    300
dtype: int64

In [50]:
x[0:2] #인천은 포함 안됨
x['서울':'인천'] #인천 포함(문자는 마지막도 포함이 된다.)

서울    1000
부산     300
인천     200
dtype: int64

In [52]:
#라벨이 문자인 경우에는 .으로도 접근 가능 
x.서울
x.인천

200

In [53]:
'부산' in x #x에 부산 라벨이 존재하냐

True

In [55]:
for k, v in x.items():
    print(k, v)

서울 1000
부산 300
인천 200

In [56]:
x.values

array([1000,  300,  200], dtype=int64)

In [58]:
# 인천에 해당되는 데이터를 추출 코드 작성
x.인천

200

In [61]:
200 in x.values

True

In [64]:
x=pd.Series([1000,400,300,200],
index=['서울','부산','인천','광주']);x

서울    1000
부산     400
인천     300
광주     200
dtype: int64

In [69]:
x2=pd.Series({'서울':1000,'부산':400,'인천':300,'대전':200});x2

서울    1000
부산     400
인천     300
대전     200
dtype: int64

In [71]:
x+x2 #인덱스가 동일한 것끼리 연산한다.
# x-x2
# x*x2

# x-x2 동일한 라벨(인덱스)끼리 연산 수행
# (어느 한쪽에만 라벨이 있는 경우 Nan/)
x.values - x2.values

array([0, 0, 0, 0], dtype=int64)

In [73]:
xx=x-x2;xx

광주    NaN
대전    NaN
부산    0.0
서울    0.0
인천    0.0
dtype: float64

In [75]:
xx[xx.notnull()] #불린 참조형 : true만 도출

부산    0.0
서울    0.0
인천    0.0
dtype: float64

In [79]:
p2020=pd.Series([1000,400,300,200],
index=['서울','부산','인천','광주'])
p2030=pd.Series([900,300,200,300],
index=['서울','부산','인천','광주'])

p20= p2030/p2020

In [83]:
p20['서울']=0.95
p20

서울    0.950000
부산    0.750000
인천    0.666667
광주    1.500000
dtype: float64

In [84]:
del p20['인천']

In [85]:
p20

서울    0.95
부산    0.75
광주    1.50
dtype: float64

In [ ]:
# 시리즈 = 1차원 배열(벡터) + 인덱스(행)
# 데이터프레임 = 2차원 배열(행렬) + 인덱스(행,열)

In [89]:
import numpy as np

In [90]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, np.nan],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

In [87]:
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774],
 '2005': [9762546, 3512547, 2517680, 2456016],
 '2000': [9853972, 3655437, 2466338, 2473990],
 '지역': ['수도권', '경상권', '수도권', '경상권'],
 '2010-2015 증가율': [0.0283, 0.0163, 0.0982, 0.0141]}

In [91]:
pd.DataFrame(data)
# 키가 데이터프레임의 열 인덱스가 됨 
# 값은 데이터프레임의 데이터가 됨 
# 0번- 행 인덱스가 자동 부여됨

      2015       2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482.0  9762546  9853972  수도권         0.0283
1  3448737  3393191.0  3512547  3655437  경상권         0.0163
2  2890451  2632035.0  2517680  2466338  수도권         0.0982
3  2466052        NaN  2456016  2473990  경상권         0.0141

In [92]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}

In [97]:
df=pd.DataFrame(data, index=['서울', '부산', '인천', '대구'],
        columns=['지역','2000', '2005', '2010', '2015', '2010-2015 증가율']);dfㅠ

     지역     2000     2005     2010     2015  2010-2015 증가율
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
대구  경상권  2473990  2456016  2431774  2466052         0.0141

In [98]:
df=pd.DataFrame(data, index=['서울', '부산', '인천', '대구'],
        columns=['지역','2000', '2005', '2010', '2020', '2010-2015 증가율']);df

     지역     2000     2005     2010 2020  2010-2015 증가율
서울  수도권  9853972  9762546  9631482  NaN         0.0283
부산  경상권  3655437  3512547  3393191  NaN         0.0163
인천  수도권  2466338  2517680  2632035  NaN         0.0982
대구  경상권  2473990  2456016  2431774  NaN         0.0141

In [99]:
df=pd.DataFrame(data, index=['서울', '부산', '인천', '대구'],
        columns=['지역','2000', '2005', '2010', '2015', '2010-2015 증가율']);df

     지역     2000     2005     2010     2015  2010-2015 증가율
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
대구  경상권  2473990  2456016  2431774  2466052         0.0141

In [101]:
df.index #행 인덱스
df.columns #열 인덱스

Index(['지역', '2000', '2005', '2010', '2015', '2010-2015 증가율'], dtype='object')

In [102]:
df.columns=['a','b','c','d','e','f'];df

      a        b        c        d        e       f
서울  수도권  9853972  9762546  9631482  9904312  0.0283
부산  경상권  3655437  3512547  3393191  3448737  0.0163
인천  수도권  2466338  2517680  2632035  2890451  0.0982
대구  경상권  2473990  2456016  2431774  2466052  0.0141

In [107]:
df=pd.DataFrame(data, index=['서울', '부산', '인천', '대구']);df

df.rename(columns={'지역':'a', '2000':'b', '2005':'c', 
'2010':'d', '2015':'e', '2010-2015 증가율':'f'
})#rename : 이전 컬럼이름 : 이후 컬럼이름

df.rename(index={'서울':'s', '부산':'b'})

       2015     2010     2005     2000   지역  2010-2015 증가율
s   9904312  9631482  9762546  9853972  수도권         0.0283
b   3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [108]:
df=pd.DataFrame(data, index=['서울', '부산', '인천', '대구']);df

       2015     2010     2005     2000   지역  2010-2015 증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [109]:
df.T

                    서울       부산       인천       대구
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
지역                 수도권      경상권      수도권      경상권
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [110]:
df.T.T

       2015     2010     2005     2000   지역 2010-2015 증가율
서울  9904312  9631482  9762546  9853972  수도권        0.0283
부산  3448737  3393191  3512547  3655437  경상권        0.0163
인천  2890451  2632035  2517680  2466338  수도권        0.0982
대구  2466052  2431774  2456016  2473990  경상권        0.0141

In [112]:
df['증가율']=df['2010-2015 증가율']*100;df

       2015     2010     2005     2000   지역  2010-2015 증가율   증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283  2.83
부산  3448737  3393191  3512547  3655437  경상권         0.0163  1.63
인천  2890451  2632035  2517680  2466338  수도권         0.0982  9.82
대구  2466052  2431774  2456016  2473990  경상권         0.0141  1.41

In [113]:
del df['2010-2015 증가율'];df

       2015     2010     2005     2000   지역   증가율
서울  9904312  9631482  9762546  9853972  수도권  2.83
부산  3448737  3393191  3512547  3655437  경상권  1.63
인천  2890451  2632035  2517680  2466338  수도권  9.82
대구  2466052  2431774  2456016  2473990  경상권  1.41

In [116]:
df['지역'] #결과가 시리즈로 나옴
df[['지역']] #데이터프레임
df[['2000', '2005']]

       2000     2005
서울  9853972  9762546
부산  3655437  3512547
인천  2466338  2517680
대구  2473990  2456016

In [ ]:
# recurrent : 다시 현재가 되다 (RNN)

In [119]:
df = pd.read_csv('e:/data/gapminder.tsv', sep='\t');df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [123]:
df.shape #행과 열의 개수
df.dtypes
df.columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [126]:
df.head(3)
df.tail(3)

       country continent  year  lifeExp       pop   gdpPercap
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [129]:
df['country']
countryDf=df.country ; countryDf

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [131]:
type(countryDf)
countryDf.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [132]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [133]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [135]:
subset=df[['country','continent','year']]

In [136]:
subset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
dtypes: int64(1), object(2)
memory usage: 40.1+ KB

In [138]:
df.iloc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [140]:
df.T[0] #0번 열 인덱스

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [143]:
df.loc[1700]
df.iloc[1700]
df.iloc[-4]

country      Zimbabwe
continent      Africa
year             1992
lifeExp        60.377
pop          10704340
gdpPercap     693.421
Name: 1700, dtype: object

In [146]:
df.shape[0]
df.shape[0]-1 #마지막 행 번호

1703

In [147]:
df.loc[[0,100,200]]

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
100    Bangladesh      Asia  1972   45.252  70759295  630.233627
200  Burkina Faso    Africa  1992   50.260   8878303  931.752773

In [160]:
df['year']
df[['year','pop']]
df.iloc[:, [2,4]] # :은 전체를 의미
df.loc[:, 'country']
df.iloc[:, [0,2,4]]
df.iloc[:, [0,2,-3]]

          country  year  lifeExp
0     Afghanistan  1952   28.801
1     Afghanistan  1957   30.332
2     Afghanistan  1962   31.997
3     Afghanistan  1967   34.020
4     Afghanistan  1972   36.088
...           ...   ...      ...
1699     Zimbabwe  1987   62.351
1700     Zimbabwe  1992   60.377
1701     Zimbabwe  1997   46.809
1702     Zimbabwe  2002   39.989
1703     Zimbabwe  2007   43.487

[1704 rows x 3 columns]

In [164]:
df.shape[1] #6은 열의 개수를 의미
df.iloc[:,[0, 3, df.shape[1]-1]]

          country  lifeExp   gdpPercap
0     Afghanistan   28.801  779.445314
1     Afghanistan   30.332  820.853030
2     Afghanistan   31.997  853.100710
3     Afghanistan   34.020  836.197138
4     Afghanistan   36.088  739.981106
...           ...      ...         ...
1699     Zimbabwe   62.351  706.157306
1700     Zimbabwe   60.377  693.420786
1701     Zimbabwe   46.809  792.449960
1702     Zimbabwe   39.989  672.038623
1703     Zimbabwe   43.487  469.709298

[1704 rows x 3 columns]

In [172]:
df.iloc[ : , 0:6:2]

          country  year       pop
0     Afghanistan  1952   8425333
1     Afghanistan  1957   9240934
2     Afghanistan  1962  10267083
3     Afghanistan  1967  11537966
4     Afghanistan  1972  13079460
...           ...   ...       ...
1699     Zimbabwe  1987   9216418
1700     Zimbabwe  1992  10704340
1701     Zimbabwe  1997  11404948
1702     Zimbabwe  2002  11926563
1703     Zimbabwe  2007  12311143

[1704 rows x 3 columns]

In [173]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [177]:
df.loc[[0,99,999] , ['country', 'lifeExp', 'gdpPercap']]

         country  lifeExp    gdpPercap
0    Afghanistan   28.801   779.445314
99    Bangladesh   43.453   721.186086
999     Mongolia   51.253  1226.041130

In [179]:
# df에서 year열의 유일한 값들의 집합을 출력
df.year.unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [181]:
df.drop_duplicates('year')['year'] # drop해라 중복된 것을 year기준에서

0     1952
1     1957
2     1962
3     1967
4     1972
5     1977
6     1982
7     1987
8     1992
9     1997
10    2002
11    2007
Name: year, dtype: int64

In [195]:
df.continent.unique()
df.country.unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [200]:
df[df['pop'] > 50000000]
# df[df.pop > 50000000] #데이터프레임에도 pop 메서드가 있다. 따라서 사용불가

         country continent  year  lifeExp       pop    gdpPercap
97    Bangladesh      Asia  1957   39.348  51365468   661.637458
98    Bangladesh      Asia  1962   41.216  56839289   686.341554
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
100   Bangladesh      Asia  1972   45.252  70759295   630.233627
101   Bangladesh      Asia  1977   46.923  80428306   659.877232
...          ...       ...   ...      ...       ...          ...
1651     Vietnam      Asia  1987   62.820  62826491   820.799445
1652     Vietnam      Asia  1992   67.662  69940728   989.023149
1653     Vietnam      Asia  1997   70.672  76048996  1385.896769
1654     Vietnam      Asia  2002   73.017  80908147  1764.456677
1655     Vietnam      Asia  2007   74.249  85262356  2441.576404

[190 rows x 6 columns]

In [205]:
df1=pd.DataFrame([[0,1,2],[3,4,5]], index=['r1','r2'], columns=['c1','c2','c3']);df1

    c1  c2  c3
r1   0   1   2
r2   3   4   5

In [206]:
df1.pop('c2')

r1    1
r2    4
Name: c2, dtype: int64

In [213]:
df1.pop('c1')

r1    0
r2    3
Name: c1, dtype: int64

In [214]:
df1

    c3
r1   2
r2   5

In [215]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]